import { describe, expect, test, vi } from "vitest";

describe("SearchInput", () => {
  test.todo("検索入力欄が空の時、「検索」ボタンが無効になる", () => {});

  test.todo(
    "検索入力欄に内容入力されている時、「検索」ボタンが有効になる",
    () => {},
  );

  test.todo(
    "現在の絞り込み文言がない場合、「クリア」ボタンが無効になる",
    () => {},
  );

  test.todo(
    "現在の絞り込み文言がある場合、「クリア」ボタンが有効になる",
    () => {},
  );

  test.todo(
    "検索入力欄の内容と現在の絞り込み文言が同じ場合、「検索」ボタンが無効になる",
    () => {},
  );

  test.todo(
    "検索入力欄の内容と現在の絞り込み文言が異なる場合、「検索」ボタンが有効になる",
    () => {},
  );

  test.todo(
    "「検索」ボタンをクリックした時、検索入力欄の内容を引数として関数が発火する",
    () => {},
  );

  test.todo(
    "「クリア」ボタンをクリックした時、空の文字列を引数として関数が発火する",
    () => {},
  );
});
